In this lab:
1. Understand the dataset for Chicago Public School level performance 
1. Store the dataset in an Db2 database on IBM Cloud instance
1. Retrieve metadata about tables and columns and query data from mixed case columns
1. Solve example problems to practice your SQL skills including using built-in database functions

#### Chicago Public Schools - Progress Report Cards (2011-2012) 

The city of Chicago released a dataset showing all school level performance data used to create School Report Cards for the 2011-2012 school year. The dataset is available from the Chicago Data Portal: https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t

This dataset includes a large number of metrics. Start by familiarizing yourself with the types of metrics in the database: https://data.cityofchicago.org/api/assets/AAD41A13-BE8A-4E67-B1F5-86E711E09D5F?download=true

__NOTE__: Do not download the dataset directly from City of Chicago portal. Instead download a more database friendly version from the link below.
Now download a static copy of this database and review some of its contents:
https://ibm.box.com/shared/static/f9gjvj1gjmxxzycdhplzt01qtz0s7ew7.csv

#### Store the dataset in a Table
In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. To analyze the data using SQL, it first needs to be stored in the database.

While it is easier to read the dataset into a Pandas dataframe and then PERSIST it into the database as we saw in the previous lab, it results in mapping to default datatypes which may not be optimal for SQL querying. For example a long textual field may map to a CLOB instead of a VARCHAR. 

Therefore, __it is highly recommended to manually load the table using the database console LOAD tool, as indicated in Week 2 Lab 1 Part II__. The only difference with that lab is that in Step 5 of the instructions you will need to click on create "(+) New Table" and specify the name of the table you want to create and then click "Next". 

##### Now open the Db2 console, open the LOAD tool, Select / Drag the .CSV file for the CHICAGO PUBLIC SCHOOLS dataset and load the dataset into a new table called __SCHOOLS__.

<a href="https://cognitiveclass.ai"><img src = "https://ibm.box.com/shared/static/uc4xjh1uxcc78ks1i18v668simioz4es.jpg"></a>

#### Connect to the database
Let load the ipython-sql  extension and establish a connection with the database

In [24]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [37]:
import pandas as pd

In [149]:
import seaborn as sns

In [23]:
%sql ibm_db_sa://zcl11296:8qml-p1w2w8js19m@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB

'Connected: zcl11296@BLUDB'

#### Query the database system catalog to retrieve table metadata
You can verify that the table creation was successful by retrieving the list of all tables in your schema and checking whether the SCHOOLS table was created

In [170]:
# why there is no table name with this? 
%sql select TABSCHEMA, TABNAME, CREATE_TIME \
from SYSCAT.TABLES \
where tabschema = 'zcl11296'

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[]

In [171]:
%sql select * \
from SYSCAT.TABLES \
where TABNAME = 'SCHOOLS'

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('ZCL11296', 'SCHOOLS', 'ZCL11296', 'U', 'T', 'N', None, None, None, None, datetime.datetime(2020, 3, 22, 18, 30, 17, 344968), datetime.datetime(2020, 3, 22, 18, 30, 17, 344968), datetime.datetime(2020, 3, 22, 18, 30, 17, 344968), datetime.datetime(2020, 3, 22, 18, 34, 31, 996112), 78, 13, 4144, 566, 15, 0, 16, -1, -1, -1, 0, 'zcl11296space1', None, None, 0, 0, 0, 0, 0, 0, 0, 'N', 'YYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY', 1, ' ', '0', -1, 'N', ' ', None, 'R', ' ', 'N', '                                ', None, 'N', ' ', 'F', None, 0, 'N', 999, 0, 0.0, 844, 0.0, None, 1208, 'SYSIBM', 'IDENTITY', 'SYSIBM', 'IDENTITY', ' ', 0, datetime.datetime(2020, 3, 22, 18, 30, 17, 344968), 0, ' ', None, None, 'N', 'ZCL11296', ' ', ' ', ' ', datetime.date(2020, 3, 22), ' ', 'N', 'R', 'N', -1.0, None)]

#### Query the database system catalog to retrieve column metadata
The SCHOOLS table contains a large number of columns. How many columns does this table have?

In [27]:
#! colcount is the columns number. 
%sql select colcount \
from SYSCAT.TABLES \
where TABNAME = 'SCHOOLS'

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(78,)]

In [28]:
#! SYSCAT.COLUMNS 
%sql select count(*) \
from SYSCAT.COLUMNS \
where TABNAME = 'SCHOOLS'

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('78'),)]

 Columns in SCHOOLS table and their column type (datatype) and length:

In [29]:
%sql select COLNAME as "Column name", TYPENAME as "Type", LENGTH as "Lenght"\
from SYSCAT.COLUMNS \
where TABNAME = 'SCHOOLS'

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('School_ID', 'INTEGER', 4),
 ('NAME_OF_SCHOOL', 'VARCHAR', 65),
 ('Elementary, Middle, or High School', 'VARCHAR', 2),
 ('Street_Address', 'VARCHAR', 30),
 ('City', 'VARCHAR', 7),
 ('State', 'VARCHAR', 2),
 ('ZIP_Code', 'INTEGER', 4),
 ('Phone_Number', 'VARCHAR', 14),
 ('Link', 'VARCHAR', 78),
 ('Network_Manager', 'VARCHAR', 40),
 ('Collaborative_Name', 'VARCHAR', 34),
 ('Adequate_Yearly_Progress_Made_', 'VARCHAR', 3),
 ('Track_Schedule', 'VARCHAR', 12),
 ('CPS_Performance_Policy_Status', 'VARCHAR', 16),
 ('CPS_Performance_Policy_Level', 'VARCHAR', 15),
 ('HEALTHY_SCHOOL_CERTIFIED', 'VARCHAR', 3),
 ('Safety_Icon', 'VARCHAR', 11),
 ('SAFETY_SCORE', 'SMALLINT', 2),
 ('Family_Involvement_Icon', 'VARCHAR', 11),
 ('Family_Involvement_Score', 'VARCHAR', 3),
 ('Environment_Icon', 'VARCHAR', 11),
 ('Environment_Score', 'SMALLINT', 2),
 ('Instruction_Icon', 'VARCHAR', 11),
 ('Instruction_Score', 'SMALLINT', 2),
 ('Leaders_Icon', 'VARCHAR', 11),
 ('Leaders_Score', 'VARCHAR', 3),
 ('Teachers_Icon', 'VARCHAR', 11),
 ('Teachers_Score', 'VARCHAR', 3),
 ('Parent_Engagement_Icon', 'VARCHAR', 7),
 ('Parent_Engagement_Score', 'VARCHAR', 3),
 ('Parent_Environment_Icon', 'VARCHAR', 7),
 ('Parent_Environment_Score', 'VARCHAR', 3),
 ('AVERAGE_STUDENT_ATTENDANCE', 'VARCHAR', 6),
 ('Rate_of_Misconducts__per_100_students_', 'DECIMAL', 5),
 ('Average_Teacher_Attendance', 'VARCHAR', 6),
 ('Individualized_Education_Program_Compliance_Rate', 'VARCHAR', 7),
 ('Pk_2_Literacy__', 'VARCHAR', 4),
 ('Pk_2_Math__', 'VARCHAR', 4),
 ('Gr3_5_Grade_Level_Math__', 'VARCHAR', 4),
 ('Gr3_5_Grade_Level_Read__', 'VARCHAR', 4),
 ('Gr3_5_Keep_Pace_Read__', 'VARCHAR', 4),
 ('Gr3_5_Keep_Pace_Math__', 'VARCHAR', 4),
 ('Gr6_8_Grade_Level_Math__', 'VARCHAR', 4),
 ('Gr6_8_Grade_Level_Read__', 'VARCHAR', 4),
 ('Gr6_8_Keep_Pace_Math_', 'VARCHAR', 4),
 ('Gr6_8_Keep_Pace_Read__', 'VARCHAR', 4),
 ('Gr_8_Explore_Math__', 'VARCHAR', 4),
 ('Gr_8_Explore_Read__', 'VARCHAR', 4),
 ('ISAT_Exceeding_Math__', 'DECIMAL', 4),
 ('ISAT_Exceeding_Reading__', 'DECIMAL', 4),
 ('ISAT_Value_Add_Math', 'DECIMAL', 3),
 ('ISAT_Value_Add_Read', 'DECIMAL', 3),
 ('ISAT_Value_Add_Color_Math', 'VARCHAR', 6),
 ('ISAT_Value_Add_Color_Read', 'VARCHAR', 6),
 ('Students_Taking__Algebra__', 'VARCHAR', 4),
 ('Students_Passing__Algebra__', 'VARCHAR', 4),
 ('9th Grade EXPLORE (2009)', 'VARCHAR', 4),
 ('9th Grade EXPLORE (2010)', 'VARCHAR', 4),
 ('10th Grade PLAN (2009)', 'VARCHAR', 4),
 ('10th Grade PLAN (2010)', 'VARCHAR', 4),
 ('Net_Change_EXPLORE_and_PLAN', 'VARCHAR', 3),
 ('11th Grade Average ACT (2011)', 'VARCHAR', 4),
 ('Net_Change_PLAN_and_ACT', 'VARCHAR', 3),
 ('College_Eligibility__', 'VARCHAR', 4),
 ('Graduation_Rate__', 'VARCHAR', 4),
 ('College_Enrollment_Rate__', 'VARCHAR', 4),
 ('COLLEGE_ENROLLMENT', 'SMALLINT', 2),
 ('General_Services_Route', 'SMALLINT', 2),
 ('Freshman_on_Track_Rate__', 'VARCHAR', 4),
 ('X_COORDINATE', 'DECIMAL', 13),
 ('Y_COORDINATE', 'DECIMAL', 13),
 ('Latitude', 'DECIMAL', 18),
 ('Longitude', 'DECIMAL', 18),
 ('COMMUNITY_AREA_NUMBER', 'SMALLINT', 2),
 ('COMMUNITY_AREA_NAME', 'VARCHAR', 22),
 ('Ward', 'SMALLINT', 2),
 ('Police_District', 'SMALLINT', 2),
 ('Location', 'VARCHAR', 27)]

#### Questions
1. Is the column name for the "SCHOOL ID" attribute in upper or mixed case? **_Mixed case_**
1. What is the name of "Community Area Name" column in your table? Does it have spaces? **_COMMUNITY_AREA_NAME, no there is underscores, not spaces_**
1. Are there any columns in whose names the spaces and paranthesis (round brackets) have been replaced by the underscore character "_"? **_Yes_**

#### Problems

##### Problem 1: How many Elementary Schools are in the dataset?

In [65]:
#let's put our table in pandas dataframe
data = %sql select * from SCHOOLS 

data_df = data.DataFrame()

#data_df.head()

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

In [51]:
# Let's see columns names in dataframe
#list(data_df.columns)

In [68]:
#change spaces to underscores in 3rd columns
data_df = data_df.rename(columns={'Elementary, Middle, or High School':'Elementary_Middle_or_High_School'})

In [69]:
# count the unique values in 3rd column
data_df.Elementary_Middle_or_High_School.value_counts()

ES    462
HS     93
MS     11
Name: Elementary_Middle_or_High_School, dtype: int64

Answer - 462 Elementary schools

In [75]:
#solution in pandas for problem 1
school_types = data_df.Elementary_Middle_or_High_School.value_counts()
ES_count = school_types[0]

print("There is", ES_count, "Elementary schools in this dataset")

There is 462 Elementary schools in this dataset

In [78]:
#Solution in sql for problem 
%sql select  "Elementary, Middle, or High School", count("Elementary, Middle, or High School") as "Count"\
from SCHOOLS \
group by "Elementary, Middle, or High School"

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('ES', Decimal('462')), ('HS', Decimal('93')), ('MS', Decimal('11'))]

In [80]:
#Given solution:
%sql select count(*) \
from SCHOOLS \
where "Elementary, Middle, or High School" = 'ES'

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('462'),)]

#### Problem 2: What is the highest Safety Score?

In [83]:
%sql select max(SAFETY_SCORE) as MAX_SAFETY_SCORE\
from SCHOOLS

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(99,)]

#### Problem 3: Which schools have highest Safety Score?

In [85]:
%sql select NAME_OF_SCHOOL as schools_with_maximum_safety_score, Safety_Score\
from SCHOOLS\
where SAFETY_SCORE = (select max(SAFETY_SCORE) as MAX_SAFETY_SCORE\
                        from SCHOOLS)

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('Abraham Lincoln Elementary School', 99),
 ('Alexander Graham Bell Elementary School', 99),
 ('Annie Keller Elementary Gifted Magnet School', 99),
 ('Augustus H Burley Elementary School', 99),
 ('Edgar Allan Poe Elementary Classical School', 99),
 ('Edgebrook Elementary School', 99),
 ('Ellen Mitchell Elementary School', 99),
 ('James E McDade Elementary Classical School', 99),
 ('James G Blaine Elementary School', 99),
 ('LaSalle Elementary Language Academy', 99),
 ('Mary E Courtenay Elementary Language Arts Center', 99),
 ('Northside College Preparatory High School', 99),
 ('Northside Learning Center High School', 99),
 ('Norwood Park Elementary School', 99),
 ('Oriole Park Elementary School', 99),
 ('Sauganash Elementary School', 99),
 ('Stephen Decatur Classical Elementary School', 99),
 ('Talman Elementary School', 99),
 ('Wildwood Elementary School', 99)]

In [94]:
#What type of schools have the highest scores? 
%sql select "Elementary, Middle, or High School", count("Elementary, Middle, or High School")\
from SCHOOLS\
where SAFETY_SCORE = (select max(SAFETY_SCORE) from SCHOOLS)\
group by "Elementary, Middle, or High School"

#no middle schools

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('ES', Decimal('17')), ('HS', Decimal('2'))]

#### Problem 4: What are the top 10 schools with the highest "Average Student Attendance"?

In [103]:
%sql select NAME_OF_SCHOOL as top_10_schools_by_avg, Average_Student_Attendance\
from SCHOOLS\
order by Average_Student_Attendance desc nulls last\
limit 10

#Nulls last - rows without values at the bottom. by default - at the top.

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('John Charles Haines Elementary School', '98.40%'),
 ('James Ward Elementary School', '97.80%'),
 ('Edgar Allan Poe Elementary Classical School', '97.60%'),
 ('Orozco Fine Arts & Sciences Elementary School', '97.60%'),
 ('Rachel Carson Elementary School', '97.60%'),
 ('Annie Keller Elementary Gifted Magnet School', '97.50%'),
 ('Andrew Jackson Elementary Language Academy', '97.40%'),
 ('Lenart Elementary Regional Gifted Center', '97.40%'),
 ('Disney II Magnet School', '97.30%'),
 ('John H Vanderpoel Elementary Magnet School', '97.20%')]

#### Problem 5: Retrieve the list of 5 Schools with the lowest Average Student Attendance sorted in ascending order based on attendance

In [104]:
%sql select NAME_OF_SCHOOL as bottom_5_schools_by_avg, Average_Student_Attendance\
from SCHOOLS\
order by Average_Student_Attendance \
limit 5

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Dyett High School', '62.50%'),
 ('Wendell Phillips Academy High School', '63.00%'),
 ('Orr Academy High School', '66.30%')]

In [105]:
#Solution from the lesson:
%sql SELECT Name_of_School, Average_Student_Attendance  \
     from SCHOOLS \
     order by Average_Student_Attendance \
     fetch first 5 rows only

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Dyett High School', '62.50%'),
 ('Wendell Phillips Academy High School', '63.00%'),
 ('Orr Academy High School', '66.30%')]

#### Problem 6: Now remove the '%' sign from the above result set for Average Student Attendance column

In [117]:
%sql select NAME_OF_SCHOOL as bottom_5_schools_by_avg_attendance, \
REPLACE(Average_Student_Attendance,'%','') as average_student_attendance\
from SCHOOLS\
order by Average_Student_Attendance \
limit 5

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('Richard T Crane Technical Preparatory High School', '57.90'),
 ('Barbara Vick Early Childhood & Family Center', '60.90'),
 ('Dyett High School', '62.50'),
 ('Wendell Phillips Academy High School', '63.00'),
 ('Orr Academy High School', '66.30')]

In [115]:
#Solution in the lesson:
%sql SELECT Name_of_School, REPLACE(Average_Student_Attendance, '%', '') \
     from SCHOOLS \
     order by Average_Student_Attendance \
     fetch first 5 rows only

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('Richard T Crane Technical Preparatory High School', '57.90'),
 ('Barbara Vick Early Childhood & Family Center', '60.90'),
 ('Dyett High School', '62.50'),
 ('Wendell Phillips Academy High School', '63.00'),
 ('Orr Academy High School', '66.30')]

#### Problem 7: Which Schools have Average Student Attendance lower than 70%?

In [130]:
%sql select NAME_OF_SCHOOL as "schools_with_>70%", Average_Student_Attendance\
from SCHOOLS\
where DECIMAL(REPLACE(Average_Student_Attendance, '%', '')) < 70\
order by Average_Student_Attendance

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Dyett High School', '62.50%'),
 ('Wendell Phillips Academy High School', '63.00%'),
 ('Orr Academy High School', '66.30%'),
 ('Manley Career Academy High School', '66.80%'),
 ('Chicago Vocational Career Academy High School', '68.80%'),
 ('Roberto Clemente Community Academy High School', '69.60%')]

#### Problem 8: Get the total College Enrollment for each Community Area

In [159]:
%sql select COMMUNITY_AREA_NAME, sum(COLLEGE_ENROLLMENT) as total_college_enrollment\
from SCHOOLS\
group by COMMUNITY_AREA_NAME

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('ALBANY PARK', 6864),
 ('ARCHER HEIGHTS', 4823),
 ('ARMOUR SQUARE', 1458),
 ('ASHBURN', 6483),
 ('AUBURN GRESHAM', 4175),
 ('AUSTIN', 10933),
 ('AVALON PARK', 1522),
 ('AVONDALE', 3640),
 ('BELMONT CRAGIN', 14386),
 ('BEVERLY', 1636),
 ('BRIDGEPORT', 3167),
 ('BRIGHTON PARK', 9647),
 ('BURNSIDE', 549),
 ('CALUMET HEIGHTS', 1568),
 ('CHATHAM', 5042),
 ('CHICAGO LAWN', 7086),
 ('CLEARING', 2085),
 ('DOUGLAS', 4670),
 ('DUNNING', 4568),
 ('EAST GARFIELD PARK', 5337),
 ('EAST SIDE', 5305),
 ('EDGEWATER', 4600),
 ('EDISON PARK', 910),
 ('ENGLEWOOD', 6832),
 ('FOREST GLEN', 1431),
 ('FULLER PARK', 531),
 ('GAGE PARK', 9915),
 ('GARFIELD RIDGE', 4552),
 ('GRAND BOULEVARD', 2809),
 ('GREATER GRAND CROSSING', 4051),
 ('HEGEWISCH', 963),
 ('HERMOSA', 3975),
 ('HUMBOLDT PARK', 8620),
 ('HYDE PARK', 1930),
 ('IRVING PARK', 7764),
 ('JEFFERSON PARK', 1755),
 ('KENWOOD', 4287),
 ('LAKE VIEW', 7055),
 ('LINCOLN PARK', 5615),
 ('LINCOLN SQUARE', 4132),
 ('LOGAN SQUARE', 7351),
 ('LOOP', 871),
 ('LOWER WEST SIDE', 7257),
 ('MCKINLEY PARK', 1552),
 ('MONTCLARE', 1317),
 ('MORGAN PARK', 3271),
 ('MOUNT GREENWOOD', 2091),
 ('NEAR NORTH SIDE', 3362),
 ('NEAR SOUTH SIDE', 1378),
 ('NEAR WEST SIDE', 7975),
 ('NEW CITY', 7922),
 ('NORTH CENTER', 7541),
 ('NORTH LAWNDALE', 5146),
 ('NORTH PARK', 4210),
 ('NORWOOD PARK', 6469),
 ('OAKLAND', 140),
 ('OHARE', 786),
 ('PORTAGE PARK', 6954),
 ('PULLMAN', 1620),
 ('RIVERDALE', 1547),
 ('ROGERS PARK', 4068),
 ('ROSELAND', 7020),
 ('SOUTH CHICAGO', 4043),
 ('SOUTH DEERING', 1859),
 ('SOUTH LAWNDALE', 14793),
 ('SOUTH SHORE', 4543),
 ('UPTOWN', 4388),
 ('WASHINGTON HEIGHTS', 4006),
 ('WASHINGTON PARK', 2648),
 ('WEST ELSDON', 3700),
 ('WEST ENGLEWOOD', 5946),
 ('WEST GARFIELD PARK', 2622),
 ('WEST LAWN', 4207),
 ('WEST PULLMAN', 3240),
 ('WEST RIDGE', 8197),
 ('WEST TOWN', 9429),
 ('WOODLAWN', 4206)]

#### Problem 9: Get the 5 Community Areas with the least total College Enrollment  sorted in ascending order

In [162]:
%sql select COMMUNITY_AREA_NAME, sum(COLLEGE_ENROLLMENT) as total_college_enrollment\
from SCHOOLS\
group by COMMUNITY_AREA_NAME\
order by total_college_enrollment asc\
limit 5

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('OAKLAND', 140),
 ('FULLER PARK', 531),
 ('BURNSIDE', 549),
 ('OHARE', 786),
 ('LOOP', 871)]

In [182]:
%sql select COMMUNITY_AREA_NUMBER, sum(COLLEGE_ENROLLMENT) as total_college_enrollment\
from SCHOOLS\
group by COMMUNITY_AREA_NUMBER \
order by total_college_enrollment desc\
limit 5

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(30, 14793), (19, 14386), (25, 10933), (63, 9915), (58, 9647)]

#### Problem 10: Get the hardship index for the community area which has College Enrollment of 4638

In [203]:
%%sql 
select CPS.community_area_name, hardship_index 
   from CHICAGO_SOC_DATA as CD, SCHOOLS as CPS 
   where CD.ca = CPS.community_area_number 
      and college_enrollment = 4368

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('NORTH CENTER', 6.0)]

#### Problem 11: Get the hardship index for the community area which has the highest value for College Enrollment

In [194]:
#solution from the lesson: 
%sql select ca, community_area_name, hardship_index from CHICAGO_SOC_DATA \
   where ca in \
   ( select community_area_number from schools order by college_enrollment desc limit 1 )

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(5.0, 'North Center', 6.0)]

In [205]:
%%sql 
select CPS.community_area_name, hardship_index 
   from CHICAGO_SOC_DATA as CD, SCHOOLS as CPS 
   where CD.ca = CPS.community_area_number 
      and college_enrollment = (select max(COLLEGE_ENROLLMENT) from SCHOOLS)

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[('NORTH CENTER', 6.0)]

In [206]:
#I think both solutions are wrong, because we get one of the schools area, which had the most college enrollments
# not the aggregated sum of all the areas. 
#The most enrollments had community area number 30: 
%sql select COMMUNITY_AREA_NUMBER, sum(COLLEGE_ENROLLMENT) as total_college_enrollment\
from SCHOOLS\
group by COMMUNITY_AREA_NUMBER \
order by total_college_enrollment desc\
limit 5

#I can put this table in dataframe and get answer with pandas, but how to do it with sql?

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(30, 14793), (19, 14386), (25, 10933), (63, 9915), (58, 9647)]

In [232]:
#Let's create a new table with the sums of enrollments
%sql create table enrollment as\
(select COMMUNITY_AREA_NUMBER, sum(COLLEGE_ENROLLMENT) as total_college_enrollment\
from SCHOOLS\
group by COMMUNITY_AREA_NUMBER ) WITH DATA

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[]

In [242]:
%%sql select ca, community_area_name, hardship_index 
from CHICAGO_SOC_DATA 
where ca in
(select COMMUNITY_AREA_NUMBER 
from enrollment 
order by total_college_enrollment desc 
limit 1)

 * ibm_db_sa://zcl11296:***@dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net:50000/BLUDB
Done.

[(30.0, 'South Lawndale', 96.0)]